{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "DetrForObjectDetection",
    "parent_library": "transformers.models.detr.modeling_detr"
  },
  "base_model_name_or_path": "facebook/detr-resnet-50",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "class_labels_classifier",
    "bbox_predictor"
  ],
  "peft_type": "LORA",
  "r": 1,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "decoder.layers.5.encoder_attn.out_proj"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}